package cn.whaley.sdk.utils

/**
 * 根据weatherCold得到映射的省份
 */
/*
*
* 天气code映射关系表：
01->北京
02->上海
03->天津
04->重庆
05->黑龙江
06->吉林
07->辽宁
08->内蒙古
09->河北
10->山西
11->陕西
12->山东
13->新疆
14->西藏
15->青海
16->甘肃
17->宁夏
18->河南
19->江苏
20->湖北
21->浙江
22->安徽
23->福建
24->江西
25->湖南
26->贵州
27->四川
28->广东
29->云南
30->广西
31->海南
32->香港
33->澳门
34->台湾

* */
object Location {
  lazy val areas = Array("北京", "上海", "天津", "重庆", "黑龙江", "吉林", "辽宁",
    "内蒙古", "河北", "山西", "陕西", "山东", "新疆", "西藏", "青海", "甘肃",
    "宁夏", "河南", "江苏", "湖北", "浙江", "安徽", "福建", "江西", "湖南",
    "贵州", "四川", "广东", "云南", "广西", "海南", "香港", "澳门", "台湾")

  /*val areas = Array("2北京", "6上海", "2天津", "8重庆", "1黑龙江", "1吉林", "1辽宁",
    "2内蒙古", "2河北", "3山西", "3陕西", "5山东", "4新疆", "0西藏", "4青海", "4甘肃",
    "4宁夏", "5河南", "6江苏", "7湖北", "6浙江", "5安徽", "9福建", "7江西", "7湖南",
    "8贵州", "8四川", "9广东", "9云南", "9广西", "9海南", "0香港", "0澳门", "0台湾")*/


  def codeToLocation(code:String):Int={
    if(code.length==9){
      val country = code.substring(0,3).toInt

      if(country == 101){
        val provinceCode = code.substring(3, 5).toInt
        if (provinceCode > 34) {
          99
        }else provinceCode
      }else 99
    }else 99

  }

  def getLocation(id:Int):String= {
    if(id>34){
      "其它"
    }else areas(id-1)
  }

}
